{
    "posts": [
        {
            "line": "106A-10",
            "passenger": "joao@gmail.com",
            "content": "Tenho percebido atrasos constantes na linha 106A-10 nos últimos dias, além de superlotação em horários de pico. Vários usuários têm se queixado sobre essa situação.",
            "likes": 10,
            "created_at": "2021-08-12 17:38:42",
            "_id": 1
        },
        {
            "line": "174M-10",
            "passenger": "joao@gmail.com",
            "content": "Presenciei um ônibus da linha 174M-10 com pane mecânica na Avenida Giovanni Gronchi na manhã de ontem, causando a interdição de uma das faixas. Foi um transtorno para os passageiros e também para os motoristas que trafegavam na via.",
            "likes": 7,
            "created_at": "2021-11-24 07:23:11",
            "_id": 2
        },
        {
            "line": "4312-10",
            "passenger": "joao@gmail.com",
            "content": "Tenho percebido a falta de manutenção nos veículos da frota da linha 4312-10, o que tem gerado constantes quebras e atrasos. Isso tem causado um grande desconforto para os usuários que dependem dessa linha.",
            "likes": 15,
            "created_at": "2022-01-05 10:55:59",
            "_id": 3
        },
        {
            "line": "967A-10",
            "passenger": "joao@gmail.com",
            "content": "Fiquei sabendo que um passageiro foi assaltado na noite de ontem dentro de um ônibus da linha 967A-10, que faz o trajeto entre o Terminal Capelinha e o Metrô Ana Rosa. É preocupante que esse tipo de situação ainda aconteça em transportes públicos.",
            "likes": 23,
            "created_at": "2022-03-17 22:16:29",
            "_id": 4
        },
        {
            "line": "476A-10",
            "passenger": "joao@gmail.com",
            "content": "Tenho notado que o tempo de espera nos pontos de ônibus da linha 476A-10 tem sido superior a 30 minutos, mesmo em horários de pico. Essa espera prolongada tem afetado a rotina dos usuários e gerado muita insatisfação.",
            "likes": 8,
            "created_at": "2022-04-21 18:41:06",
            "_id": 5
        },
        {
            "line": "106A-10",
            "passenger": "maria@gmail.com",
            "content": "Ontem, presenciei um acidente envolvendo um ônibus da linha 106A-10 que bateu em um carro na Avenida Morumbi. Foi um susto para todos que estavam próximos ao local do acidente e também gerou um grande congestionamento na região.",
            "likes": 20,
            "created_at": "2022-06-07 13:59:35",
            "_id": 6
        },
        {
            "line": "174M-10",
            "passenger": "maria@gmail.com",
            "content": "Percebi que vários ônibus da linha 174M-10 estão circulando com pneus carecas, o que pode representar um grande risco para os usuários, principalmente em dias de chuva. É importante que a empresa responsável pela frota dessa linha tome providências imediatas para evitar acidentes.",
            "likes": 12,
            "created_at": "2022-07-14 01:27:53",
            "_id": 7
        },
        {
            "line": "4312-10",
            "passenger": "maria@gmail.com",
            "content": "Na semana passada, um ônibus da linha 4312-10 teve um problema mecânico e precisou ser rebocado, causando um grande atraso para os usuários que estavam no veículo e nos demais que aguardavam nos pontos de ônibus. Essa situação tem se repetido com frequência nos últimos meses.",
            "likes": 6,
            "created_at": "2022-08-22 06:08:21",
            "_id": 8
        },
        {
            "line": "967A-10",
            "passenger": "maria@gmail.com",
            "content": "Um usuário da linha 967A-10 relatou que foi vítima de assédio dentro de um ônibus, e que o motorista não tomou nenhuma atitude para ajudá-la. É inaceitável que esse tipo de situação ocorra em transportes públicos, e é preciso que haja um maior cuidado e proteção por parte das empresas responsáveis.",
            "likes": 18,
            "created_at": "2022-09-30 09:14:01",
            "_id": 9
        },
        {
            "line": "476A-10",
            "passenger": "maria@gmail.com",
            "content": "Um ônibus da linha 476A-10 ficou preso em um buraco na rua no final de semana, causando um grande transtorno para os usuários que estavam dentro do veículo e também para os motoristas que trafegavam na via. É importante que as autoridades responsáveis pela manutenção das ruas e avenidas da cidade atuem com maior efetividade para evitar esse tipo de situação.",
            "likes": 9,
            "created_at": "2022-11-11 03:52:11",
            "_id": 10
        },
        {
            "line": "106A-10",
            "passenger": "jose@gmail.com",
            "content": "Hoje pela manhã, presenciei um acidente envolvendo um ônibus da linha 106A-10. O veículo colidiu com um carro na Avenida Paulista, causando grande tumulto no trânsito e deixando alguns passageiros feridos. Espero que as autoridades tomem medidas para aumentar a segurança no trânsito da cidade.",
            "likes": 23,
            "created_at": "2022-12-24 21:08:44",
            "_id": 11
        },
        {
            "line": "174M-10",
            "passenger": "jose@gmail.com",
            "content": "Ontem à noite, estava voltando para casa em um ônibus da linha 174M-10 quando o veículo foi abordado por assaltantes armados. Eles levaram pertences de vários passageiros, incluindo meu celular e carteira. É lamentável que não haja segurança suficiente nos transportes públicos de São Paulo.",
            "likes": 45,
            "created_at": "2023-01-28 11:41:16",
            "_id": 12
        },
        {
            "line": "4312-10",
            "passenger": "jose@gmail.com",
            "content": "Recentemente, tenho notado um aumento no número de assaltos nos ônibus da linha 4312-10. É preciso que as autoridades e as empresas responsáveis pela frota desses veículos atuem de forma mais enérgica para garantir a segurança dos passageiros. Não podemos viver com medo de utilizar o transporte público.",
            "likes": 17,
            "created_at": "2023-03-04 12:07:27",
            "_id": 13
        },
        {
            "line": "967A-10",
            "passenger": "jose@gmail.com",
            "content": "Um ônibus da linha 967A-10 quebrou no meio do trajeto na semana passada, causando um grande transtorno para os passageiros que estavam dentro do veículo. O problema foi resolvido somente depois de quase duas horas, o que demonstra a falta de manutenção adequada na frota dessa linha.",
            "likes": 9,
            "created_at": "2023-04-15 06:30:18",
            "_id": 14
        },
        {
            "line": "476A-10",
            "passenger": "jose@gmail.com",
            "content": "Os ônibus da linha 476A-10 estão circulando com pneus carecas, o que pode representar um grande risco para os usuários, principalmente em dias de chuva. É importante que a empresa responsável pela frota dessa linha tome providências imediatas para evitar acidentes.",
            "likes": 12,
            "created_at": "2023-05-02 19:23:47",
            "_id": 15
        },
        {
            "line": "857P-10",
            "passenger": "marcia@gmail.com",
            "content": "Na semana passada, um ônibus da linha 857P-10 teve um problema mecânico e precisou ser rebocado, causando um grande atraso para os usuários que estavam no veículo e nos demais que aguardavam nos pontos de ônibus. Essa situação tem se repetido com frequência nos últimos meses.",
            "likes": 6,
            "created_at": "2023-03-30 23:14:55",
            "_id": 16
        },
        {
            "line": "573A-10",
            "passenger": "marcia@gmail.com",
            "content": "Eu já presenciei diversas brigas entre passageiros em ônibus da linha 573A-10. Muitas vezes, as discussões começam por conta da superlotação dos veículos, o que gera desconforto e estresse. É preciso que as empresas responsáveis pela frota desses ônibus tomem providências para evitar esse tipo de situação.",
            "likes": 8,
            "created_at": "2023-04-05 09:03:02",
            "_id": 17
        },
        {
            "line": "5630-10",
            "passenger": "marcia@gmail.com",
            "content": "Há alguns meses, um ônibus da linha 5630-10 foi assaltado enquanto circulava pela Avenida Inajar de Souza. Os bandidos levaram os pertences de todos os passageiros e chegaram a agredir um idoso que tentou resistir. É inadmissível que os usuários do transporte público sejam expostos a esse tipo de violência.",
            "likes": 32,
            "created_at": "2023-05-09 04:12:01",
            "_id": 18
        },
        {
            "line": "8700-10",
            "passenger": "marcia@gmail.com",
            "content": "Recentemente, tive que utilizar um ônibus da linha 8700-10 em horário de pico e fiquei extremamente preocupado com a superlotação do veículo. Não havia espaço para todos os passageiros sentarem e muitas pessoas precisaram viajar em pé, o que é perigoso e desconfortável.",
            "likes": 14,
            "created_at": "2023-01-01 17:15:44",
            "_id": 19
        },
        {
            "line": "971X-10",
            "passenger": "marcia@gmail.com",
            "content": "Um ônibus da linha 971X-10 apresentou falha no sistema de freios durante a descida da Serra do Mar, colocando em risco a vida dos passageiros. O motorista conseguiu controlar o veículo e evitar um acidente, mas essa situação é completamente inaceitável. As empresas de transporte precisam garantir a segurança dos usuários.",
            "likes": 19,
            "created_at": "2023-04-15 16:08:48",
            "_id": 20
        },
        {
            "line": "971X-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Recentemente, um ônibus da linha 971X-10 pegou fogo durante o trajeto, assustando os passageiros e causando grande transtorno no trânsito. Felizmente, ninguém se feriu gravemente, mas a situação poderia ter sido muito pior. É fundamental que as empresas responsáveis pela frota desses veículos realizem manutenção regular e preventiva para evitar acidentes.",
            "likes": 25,
            "created_at": "2023-03-18 13:23:56",
            "_id": 21
        },
        {
            "line": "809P-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Os ônibus da linha 809P-10 estão circulando com defeitos no ar-condicionado, o que tem causado grande desconforto para os passageiros, especialmente em dias quentes. Além disso, muitos veículos dessa linha estão com bancos quebrados ou rasgados, o que é inaceitável para um serviço que deveria ser de qualidade.",
            "likes": 7,
            "created_at": "2023-04-22 00:02:18",
            "_id": 22
        },
        {
            "line": "637P-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Eu costumo utilizar a linha 637P-10 com frequência e já presenciei diversos casos de motoristas imprudentes, que dirigem em alta velocidade ou fazem manobras perigosas. Isso coloca em risco a vida dos passageiros e dos demais motoristas e pedestres. É necessário que as empresas de transporte orientem e fiscalizem seus funcionários para garantir a segurança de todos.",
            "likes": 11,
            "created_at": "2022-02-12 16:59:07",
            "_id": 23
        },
        {
            "line": "477P-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Há algumas semanas, um ônibus da linha 477P-10 ficou parado por mais de uma hora no meio do trajeto, sem que os passageiros recebessem qualquer informação ou orientação da empresa responsável. Essa falta de transparência e comunicação gera ainda mais desconforto e desconfiança por parte dos usuários do transporte público.",
            "likes": 6,
            "created_at": "2022-05-01 08:34:14",
            "_id": 24
        },
        {
            "line": "2023-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Em um dia de chuva intensa, um ônibus da linha 2023-10 apresentou vazamento de água, molhando os passageiros e danificando equipamentos eletrônicos, como celulares e notebooks. É inadmissível que um veículo de transporte público não esteja preparado para enfrentar condições climáticas adversas.",
            "likes": 23,
            "created_at": "2022-10-06 20:42:25",
            "_id": 25
        },
        {
            "line": "4028-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Já presenciei diversas vezes casos de assédio sexual dentro de ônibus da linha 4028-10. Infelizmente, muitas mulheres são vítimas desse tipo de violência e se sentem inseguras ao utilizar o transporte público. É preciso que as empresas de transporte realizem campanhas de conscientização e treinamento para seus funcionários, a fim de coibir esse tipo de comportamento.",
            "likes": 29,
            "created_at": "2023-02-17 14:08:32",
            "_id": 26
        },
        {
            "line": "875A-10",
            "passenger": "julcyhellen@gmail.com",
            "content": "Recentemente, um ônibus da linha 875A-10 se envolveu em um acidente com um carro, deixando alguns passageiros feridos. A situação foi caótica e muitos usuários ficaram sem saber o que fazer. É fundamental que as empresas de transporte estejam preparadas para lidar com esse tipo de emergência e prestem assistência adequada aos passageiros.",
            "likes": 17,
            "created_at": "2023-05-08 02:33:17",
            "_id": 27
        }
    ],
    "lines": [
        {
            "number": "106A-10",
            "description": "Terminal Princesa Isabel / Metrô Santana",
            "_id": 28
        },
        {
            "number": "174M-10",
            "description": "Metrô Santana / Terminal Parelheiros",
            "_id": 29
        },
        {
            "number": "4312-10",
            "description": "Terminal Vila Carrão / Terminal Pinheiros",
            "_id": 30
        },
        {
            "number": "967A-10",
            "description": "Terminal Santo Amaro / Terminal Pinheiros",
            "_id": 31
        },
        {
            "number": "476A-10",
            "description": "Terminal Santo Amaro / Terminal Pirituba",
            "_id": 32
        },
        {
            "number": "857P-10",
            "description": "Terminal Campo Limpo / Metrô Jabaquara",
            "_id": 33
        },
        {
            "number": "573A-10",
            "description": "Metrô Tucuruvi / Terminal Santo Amaro",
            "_id": 34
        },
        {
            "number": "5630-10",
            "description": "Terminal São Mateus / Itaim Bibi",
            "_id": 35
        },
        {
            "number": "8700-10",
            "description": "Terminal Lapa / Terminal Jardim Ângela",
            "_id": 36
        },
        {
            "number": "971X-10",
            "description": "Terminal Vila Carrão / Terminal Bandeira",
            "_id": 37
        },
        {
            "number": "809P-10",
            "description": "Terminal Campo Limpo / Terminal Pinheiros",
            "_id": 38
        },
        {
            "number": "637P-10",
            "description": "Terminal João Dias / Term. Pq. D. Pedro II",
            "_id": 39
        },
        {
            "number": "477P-10",
            "description": "Terminal Capelinha / Terminal Lapa",
            "_id": 40
        },
        {
            "number": "2023-10",
            "description": "Terminal Pirituba / CPTM Piqueri",
            "_id": 41
        },
        {
            "number": "4028-10",
            "description": "CPTM Jaraguá / Terminal Lapa",
            "_id": 42
        },
        {
            "number": "875A-10",
            "description": "Terminal Santo Amaro / Terminal Cidade Tiradentes",
            "_id": 43
        },
        {
            "number": "5362-10",
            "description": "Terminal Grajaú / Terminal Pinheiros",
            "_id": 45
        },
        {
            "number": "675I-10",
            "description": "Jardim Damasceno / Largo do Paissandu",
            "_id": 46
        },
        {
            "number": "978T-10",
            "description": "Terminal Vila Carrão / Praça do Correio",
            "_id": 47
        },
        {
            "number": "5110-10",
            "description": "Terminal Jardim Ângela / Terminal Bandeira",
            "_id": 48
        }
    ],
    "passengers": [
        {
            "name": "João da Silva",
            "email": "joao@gmail.com",
            "profile_image": "https://i.pravatar.cc/40",
            "_id": 49
        },
        {
            "name": "Maria dos Santos",
            "email": "maria@gmail.com",
            "profile_image": "https://i.pravatar.cc/40",
            "_id": 50
        },
        {
            "name": "José Saraiva",
            "email": "jose@gmail.com",
            "profile_image": "https://i.pravatar.cc/40",
            "_id": 51
        },
        {
            "name": "Márcia Aparecida",
            "email": "marcia@gmail.com",
            "profile_image": "https://i.pravatar.cc/40",
            "_id": 52
        },
        {
            "name": "Julcyhellen Keythleny da Silva",
            "email": "julcyhellen@gmail.com",
            "profile_image": "https://i.pravatar.cc/40",
            "_id": 53
        },
        {
            "name": "Foo Lano",
            "email": "foo.lano@gmail.com",
            "profile_image": "https://i.pravatar.cc/40",
            "_id": 54
        }
    ],
    "following": [
        {
            "_id": 55,
            "passenger": "foo.lano@gmail.com",
            "lines": [
                "106A-10",
                "174M-10",
                "4028-10"
            ]
        }
    ]
}